{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"name": "dense_1", "input_dim": 10, "trainable": true, "input_dtype": "float32", "W_constraint": null, "activation": "relu", "W_regularizer": null, "output_dim": 15, "batch_input_shape": [null, 10], "b_regularizer": null, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "bias": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "input_dim": 15, "trainable": true, "W_constraint": null, "activation": "tanh", "W_regularizer": null, "output_dim": 15, "b_regularizer": null, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "bias": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "input_dim": 15, "trainable": true, "W_constraint": null, "activation": "sigmoid", "W_regularizer": null, "output_dim": 1, "b_regularizer": null, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "bias": true}}], "keras_version": "1.2.1"}